app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      if Artist.find_by(:id => params[:artist_id])
        @songs = Artist.find(params[:artist_id]).songs
      else
        @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    #  binding.pry
      if Song.find_by(:id => params[:id])